<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"ccbed27bfaa46dd869cc5cfb68f66e191433126e23269600917b33ae4faaccc6","plan_job_ref":"Job Create Terraform plan (DEV) #53 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14974637149","plan_out_hash":"2cce3d8d161d2fd22f50b1dc60f39332b0bf4953cd997536744489befcd0a46c","plan_hash":"48fdf5a21d293f2604d130526004e11889391b6d7a9f9ec9b445ce699ac05d2d","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.identity will be created
+   resource "azurerm_federated_identity_credential" "identity" {
+       audience            = [
+           "api://AzureADTokenExchange",
        ]
+       id                  = (known after apply)
+       issuer              = (known after apply)
+       name                = "kubelet-federated-identity"
+       parent_id           = "****************************************************************************************************************************************************************************************************************************"
+       resource_group_name = "MC_openmrs_openmrs-dev-audioprothese-aks_francecentral"
+       subject             = "system:serviceaccount:default:workload-identity-sa"
    }

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/openmrs/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
!~      oidc_issuer_enabled                 = false -> true
+       oidc_issuer_url                     = (known after apply)
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
!~      workload_identity_enabled           = false -> true
#        (28 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #53](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14974637149)